//*****************************************************
//
// デバッグ処理[debug.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _DEBUG_H_
#define _DEBUG_H_

//*****************************************************
// インクルード
//*****************************************************
#include "effect3D.h"

//*****************************************************
// 名前空間定義
//*****************************************************
namespace debug
{
//---------------------------------
// エフェクトの生成
//---------------------------------
inline void Effect3DShort(D3DXVECTOR3 pos, D3DXCOLOR col = { 1.0f,1.0f,1.0f,1.0f }, int nLife = 5, float fRadius = 50.0f)
{
#ifdef _DEBUG
	CEffect3D::Create(pos, fRadius, nLife, col);
#endif
}
}

#endif