//*****************************************************
//
// 魚影の処理[fishshadow.cpp]
// Author:若木一真　髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "fishshadow.h"
#include "texture.h"

//*****************************************************
// マクロ定義
//*****************************************************
namespace
{
const char* PATH_TEX = "data\\TEXTURE\\enemy\\Fish_shadow.png";	// テクスチャパス
}

//====================================================
// コンストラクタ
//====================================================
CFishShadow::CFishShadow(int nPriority) : CPolygon3D(nPriority), m_nTimerVanish(0.0f)
{

}

//====================================================
// デストラクタ
//====================================================
CFishShadow::~CFishShadow()
{

}

//====================================================
// 生成処理
//====================================================
CFishShadow* CFishShadow::Create(int nPatern)
{
	CFishShadow* pFishShadow = nullptr;

	pFishShadow = new CFishShadow;

	if (pFishShadow != nullptr)
	{
		pFishShadow->Init();
		pFishShadow->InitSpawn(nPatern);
	}

	return pFishShadow;
}

//====================================================
// 初期化処理
//====================================================
HRESULT CFishShadow::Init(void)
{
	// 継承クラスの初期化
	CPolygon3D::Init();

	// テクスチャ設定
	int nIdxTexture = Texture::GetIdx(&PATH_TEX[0]);
	SetIdxTexture(nIdxTexture);

	// 前面に出す
	EnableZtest(true);

	return S_OK;
}

//====================================================
// スポーンの初期化
//====================================================
void CFishShadow::InitSpawn(int nPatern)
{

}

//====================================================
// 終了処理
//====================================================
void CFishShadow::Uninit(void)
{
	// 継承クラスの終了
	CPolygon3D::Uninit();
}

//====================================================
// 更新処理
//====================================================
void CFishShadow::Update(void)
{
	// 継承クラスの更新
	CPolygon3D::Update();
}

//====================================================
// 描画処理
//====================================================
void CFishShadow::Draw(void)
{
	// 継承クラスの描画
	CPolygon3D::Draw();
}