//*****************************************************
//
// 氷の処理[ice.cpp]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "ice.h"
#include "texture.h"

//*****************************************************
// 定数定義
//*****************************************************
namespace
{
const float SPEED_FLOWS = 1.0f;	// 流れる速度
const string PATH_TEX = "data\\TEXTURE\\UI\\ranking00.png";	// テクスチャパス
}

//*****************************************************
// 静的メンバ変数宣言
//*****************************************************
int CIce::s_nNumAll = 0;

//=====================================================
// コンストラクタ
//=====================================================
CIce::CIce(int nPriority) : CPolygon3D(nPriority), m_state(E_State::STATE_NONE), m_bBreak(false), m_bCanFind(false), m_bPeck(false)
{
	s_nNumAll++;
}

//=====================================================
// デストラクタ
//=====================================================
CIce::~CIce()
{
	s_nNumAll--;
}

//=====================================================
// 生成処理
//=====================================================
CIce *CIce::Create(E_State state)
{
	CIce *pIce = nullptr;

	if (pIce == nullptr)
	{
		pIce = new CIce;

		if (pIce != nullptr)
		{
			pIce->m_state = state;
			pIce->Init();
		}
	}

	return pIce;
}

//=====================================================
// 初期化処理
//=====================================================
HRESULT CIce::Init(void)
{
	// 継承クラスの初期化
	CPolygon3D::Init();

	int nIdx = Texture::GetIdx(&PATH_TEX[0]);
	SetIdxTexture(nIdx);

	EnableCanFind(true);

	return S_OK;
}

//=====================================================
// 終了処理
//=====================================================
void CIce::Uninit(void)
{
	// 継承クラスの終了
	CPolygon3D::Uninit();
}

//=====================================================
// 更新処理
//=====================================================
void CIce::Update(void)
{
	// 継承クラスの更新
	CPolygon3D::Update();

	if (m_state == E_State::STATE_FLOWS)
	{// 流れる状態では移動を続ける
		Flows();
	}
}

//=====================================================
// 流れる処理
//=====================================================
void CIce::Flows(void)
{
	AddPosition(D3DXVECTOR3(SPEED_FLOWS, 0.0f, 0.0f));
}

//=====================================================
// 描画処理
//=====================================================
void CIce::Draw(void)
{
	// 継承クラスの描画
	CPolygon3D::Draw();
}