//*****************************************************
//
// 硬い氷の処理[iceHard.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _ICEHARD_H_
#define _ICEHARD_H_

//*****************************************************
// インクルード
//*****************************************************
#include "ice.h"

//*****************************************************
// 前方宣言
//*****************************************************

//*****************************************************
// クラスの定義
//*****************************************************
class CIceHard : public CIce
{
public:
	CIceHard(int nPriority = 2);	// コンストラクタ
	~CIceHard();	// デストラクタ

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 変数取得・設定関数

	// 静的メンバ関数

private:

};

#endif

