//*****************************************************
//
// ロゴ表示処理[logo.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _LOGO_H_
#define _LOGO_H_

//*****************************************************
// インクルード
//*****************************************************
#include "scene.h"

//*****************************************************
// 前方宣言
//*****************************************************
class CUI;

//*****************************************************
// クラスの定義
//*****************************************************
class CLogo : public CScene
{
public:
	CLogo();	// コンストラクタ
	~CLogo();	// デストラクタ

	virtual HRESULT Init(void);
	virtual void Uninit(void);
	virtual void Update(void);
	virtual void Draw(void);

private:
	// メンバ変数
	CUI *m_pLogo;	// ロゴ
	float m_fTimerLogoDisp;	// ロゴの表示カウンター
};

#endif