//*****************************************************
//
// つっつき波紋の処理[peckWave.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _PECKWAVE_H_
#define _PECKWAVE_H_

//*****************************************************
// インクルード
//*****************************************************
#include "gameObject.h"

//*****************************************************
// 前方宣言
//*****************************************************
class CPolygon3D;

//*****************************************************
// クラス定義
//*****************************************************
class CPeckWave : public CGameObject
{
public:
	CPeckWave();	// コンストラクタ
	~CPeckWave();	// デストラクタ

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 変数取得・設定関数

	// 静的メンバ関数
	static CPeckWave *Create(void);

private:
	// メンバ関数

	// メンバ変数
	D3DXCOLOR m_col;	// 色
};

#endif